Repository: iyzico/iyzipay-woocommerce-installment
Catalog: i18n/languages/iyzico-installment-*.po
Languages: tr_tr

# MISSING_API_CREDENTIALS
source: API credentials are missing.
tr_tr: API kimlik bilgileri eksik.

# INSTALLMENT_INFO_ERROR
source: An error occurred while retrieving installment information.
tr_tr: Taksit bilgileri alınırken bir hata oluştu.

source: Security verification failed.
tr_tr: Güvenlik doğrulaması başarısız.

source: Invalid price.
tr_tr: Geçersiz fiyat.

source: Installment
tr_tr: Taksit

source: Total
tr_tr: Toplam

source: Installment Options
tr_tr: Taksit Seçenekleri

# NO_INSTALLMENT_OPTIONS
source: No installment options found.
tr_tr: Taksit seçeneği bulunamadı.

source: Price
tr_tr: Fiyat

# API_CREDENTIALS_NOT_CONFIGURED
source: API credentials are not configured
tr_tr: API kimlik bilgileri yapılandırılmamış.

# PLEASE_SELECT_OPTION
source: Please select an option.
tr_tr: Lütfen bir seçenek belirleyin.

# PRICE_INFO_NOT_FOUND
source: Price information not found.
tr_tr: Fiyat bilgisi bulunamadı.

# INSTALLMENTS_LOADING
source: Loading installments...
tr_tr: Taksit yükleniyor...

source: Unknown error
tr_tr: Bilinmeyen hata

# ERROR_PREFIX
source: Error:
tr_tr: Hata:

# CONNECTION_ERROR_RETRY
source: Connection error. Please try again.
tr_tr: Bağlantı hatası. Lütfen tekrar deneyin.

# VALID_PRICE_NOT_SPECIFIED
source: A valid price was not specified.
tr_tr: Geçerli bir fiyat belirtilmedi.

source: Installment Count
tr_tr: Taksit Sayısı

source: Installment Amount
tr_tr: Taksit Tutarı

source: iyzico Installment Options
tr_tr: iyzico Taksit Seçenekleri

# IYZICO_INSTALLMENT_SHORT
source: iyzico Installment
tr_tr: iyzico Taksit

# COPY_SUCCESS
source: Copied!
tr_tr: Kopyalandı!

# COPY_ERROR
source: Could not copy!
tr_tr: Kopyalanamadı!

# EMPTY_CREDENTIALS
source: API Key and Secret Key fields cannot be empty.
tr_tr: API Key ve Secret Key alanları boş olamaz.

source: Testing...
tr_tr: Test ediliyor...

# CONNECTED
source: Connection Successful!
tr_tr: Bağlantı Başarılı!

# DISCONNECTED
source: Connection Failed!
tr_tr: Bağlantı Başarısız!

# CONNECTION_SUCCESS
source: API connection successful.
tr_tr: API bağlantısı başarılı.

# CONNECTION_ERROR
source: API connection failed.
tr_tr: API bağlantısı başarısız.

source: Connection Not Configured
tr_tr: Bağlantı Yapılandırılmadı

source: API Settings
tr_tr: API Ayarları

source: Environment
tr_tr: Ortam

source: Live
tr_tr: Canlı (Live)

# TEST_ENV_WARNING
source: You cannot process transactions with real cards in the test environment.
tr_tr: Test ortamında gerçek kartlar ile işlem yapamazsınız.

source: API Connection Status
tr_tr: API Bağlantı Durumu

# API_STATUS_DESCRIPTION
source: Shows API connection status.
tr_tr: API bağlantı durumunu gösterir.

source: Test API Connection
tr_tr: API Bağlantısını Test Et

source: Display Settings
tr_tr: Görüntüleme Ayarları

source: Working Mode
tr_tr: Çalışma Şekli

# SHORTCODE_ONLY
source: Use Only Shortcode (Add to Product Page)
tr_tr: Sadece Shortcode Kullan (Ürün Sayfasına Ekleme)

# SHORTCODE_PLUS_TAB
source: Shortcode + Show as Tab on Product Page
tr_tr: Shortcode + Ürün Sayfasında Tab Olarak Göster

# WORKING_MODE_DESCRIPTION
source: Shortcode always works. This setting determines whether to show the installment tab on the product page.
tr_tr: Shortcode her zaman çalışır. Bu ayar ürün sayfasında taksit tabını gösterip göstermemeyi belirler.

source: Copy
tr_tr: Kopyala

# SHORTCODE_DESCRIPTION
source: Add this shortcode wherever you want to display installment information.
tr_tr: Bu shortcode'u taksit bilgilerini göstermek istediğiniz yere ekleyin.

# VAT_DYNAMIC_SETTINGS
source: VAT and Dynamic Installment Settings
tr_tr: KDV ve Dinamik Taksit Ayarları

# VAT_INCLUDED_PRICE
source: Calculate Price Including VAT
tr_tr: KDV Dahil Fiyat Hesapla

# VAT_INCLUDED_DESCRIPTION
source: When this option is enabled, installment calculations are made on the price including VAT.
tr_tr: Bu seçenek aktif edildiğinde, taksit hesaplamaları KDV dahil fiyat üzerinden yapılır.

source: VAT Rate (%)
tr_tr: KDV Oranı (%)

# VAT_RATE_DESCRIPTION
source: Enter VAT rate as a percentage. Example: 20
tr_tr: KDV oranını yüzde olarak girin. Örnek: 20

# DYNAMIC_INSTALLMENT_ACTIVE
source: Dynamic Installment System Active
tr_tr: Dinamik Taksit Sistemi Aktif

# DYNAMIC_INSTALLMENT_DESCRIPTION
source: When this option is enabled, the dynamic installment system works for variable products.
tr_tr: Bu seçenek aktif edildiğinde, varyasyonlu ürünlerde dinamik taksit sistemi çalışır.

source: Dynamic Installment Shortcode
tr_tr: Dinamik Taksit Shortcode

# DYNAMIC_SHORTCODE_DESCRIPTION
source: This shortcode is used for dynamic installment display in variable products.
tr_tr: Bu shortcode varyasyonlu ürünlerde dinamik taksit gösterimi için kullanılır.

source: Custom CSS Settings
tr_tr: Özel CSS Ayarları

source: Custom CSS Codes
tr_tr: Özel CSS Kodları

# CUSTOM_CSS_DESCRIPTION
source: You can add CSS codes to customize the installment table appearance. These CSS codes will only be applied to iyzico installment elements.
tr_tr: Taksit tablosu görünümünü özelleştirmek için CSS kodları ekleyebilirsiniz. Bu CSS kodları sadece iyzico taksit elementlerine uygulanacaktır.

source: Example CSS Classes:
tr_tr: Örnek CSS sınıfları:

source: Installment table
tr_tr: Taksit tablosu

source: Installment amounts
tr_tr: Taksit tutarları

source: Table header
tr_tr: Tablo başlığı

source: Card logos
tr_tr: Kart logoları

source: Save Settings
tr_tr: Ayarları Kaydet

# INSUFFICIENT_PERMISSIONS
source: You do not have sufficient permissions.
tr_tr: Yetkiniz yok.
